3B/CS486/12-Bayesian-Learning.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-11 Mon 01:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Bayesian Learning</title>
<meta name="author" content="DESKTOP-H800RKQ" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/latex.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Bayesian Learning</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb838269">1. Bayesian Learning</a></li>
<li><a href="#orgd562729">2. Maximum a Posteriori (MAP)</a></li>
<li><a href="#orgd3db216">3. Maximum Likelihood (ML)</a>
<ul>
<li><a href="#orge8bbe3b">3.1. Binomial Distribution</a></li>
</ul>
</li>
<li><a href="#org8fb026d">4. Classifiers</a>
<ul>
<li><a href="#org64a6470">4.1. Laplace Correction</a></li>
<li><a href="#org805510b">4.2. Bayesian Network Parameter Learning</a></li>
<li><a href="#orga1c6616">4.3. Occam&rsquo;s Razor</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgb838269" class="outline-2">
<h2 id="orgb838269"><span class="section-number-2">1.</span> Bayesian Learning</h2>
<div class="outline-text-2" id="text-1">
<p>
Premise:
</p>
<ul class="org-ul">
<li>have a number of hypotheses or models</li>
<li>assume all are correct to some degree</li>
<li>have a distribution over the models</li>
<li>compute expected prediction given this average</li>
</ul>

<p>
For input features \(X\), target feature \(Y\), and evidence
\(d = \{ x_{1}, y_{1}, \dots, x_{N}, y_{N} \}\), with new input \(x\)
to find the corresponding output \(y\) sum over all models
\[ P(Y \mid x, d) = \sum_{m \in M} P(Y \mid m, x) P(m \mid d) \]
</p>

<p>
For a hypothesis \(H\), the <b>prior</b> is \(P(H)\) and the <b>likelihood</b> is
\(P(d \mid H)\).
With <b>Bayesian Learning</b>, update the posterior (Bayes theorem)
\[ P(H \mid d) \propto P(d \mid H) P(H) \]
To predict \(X\)
\[ P(X \mid d) = \sum_{i} P(X \mid h_{i}) P(h_{i} \mid d) \]
Predictions are weighted averages of the predictions of the individual hypotheses.
The hypotheses serve as intermediaries between raw data and predictions.
</p>

<p>
Properties of Bayesian learning:
</p>
<ul class="org-ul">
<li><b>optional</b>: given the prior, no other prediction is correct more often than
the Bayesian one</li>
<li><b>no overfitting</b>: the prior and likelihood both penalize complex hypotheses</li>
</ul>

<p>
Bayesian learning may be unmanageable when the hypothesis space is large.
Further, the sum over hypotheses space may be unmanageable.
The solution is to approximate Bayesian learning with other strategies.
</p>
</div>
</div>
<div id="outline-container-orgd562729" class="outline-2">
<h2 id="orgd562729"><span class="section-number-2">2.</span> Maximum a Posteriori (MAP)</h2>
<div class="outline-text-2" id="text-2">
<p>
Make predictions based on the most probable hypothesis \(h_{MAP}\)
where
\[ h_{MAP} = \text{argmax}_{h_{i}} P(h_{i} \mid d) \]
Note that
\[ P(X \mid d) \approx P(X \mid h_{MAP}) \]
</p>

<p>
Less accurate than full Bayesian, but converges as data increases.
No overfitting like Bayesian.
Finding \(h_{MAP}\) may be unmanageable since the following induces nonlinear
optimization
\[ h_{MAP} = \text{argmax}_{h} P(h) \prod_{i} P(d_{i} \mid h) \]
Taking the log can linearize this.
</p>
</div>
</div>
<div id="outline-container-orgd3db216" class="outline-2">
<h2 id="orgd3db216"><span class="section-number-2">3.</span> Maximum Likelihood (ML)</h2>
<div class="outline-text-2" id="text-3">
<p>
Simplify MAP by assuming uniform prior:
\[ h_{ML} = \text{argmax}_{h} P(d \mid h) \]
so make prediction based solely on \(h_{ML}\):
\[ P(X \mid d) \approx P(X \mid h_{ML}) \]
</p>

<p>
Less accurate than full Bayesian or MAP, but converges as data increases.
More susceptible to overfitting since no prior.
\(h_{ML}\) is easier to find than \(h_{MAP}\), especially taking the log.
</p>
</div>
<div id="outline-container-orge8bbe3b" class="outline-3">
<h3 id="orge8bbe3b"><span class="section-number-3">3.1.</span> Binomial Distribution</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Generalize the hypothesis space to a continuous quantity using the
binomial distribution.
</p>

<p>
For priors on binomials, the <b>Beta distribution</b> is
\[ B(\theta ; a, b) \propto \theta^{a-1}(1-\theta)^{b-1} \]
</p>
</div>
</div>
</div>
<div id="outline-container-org8fb026d" class="outline-2">
<h2 id="org8fb026d"><span class="section-number-2">4.</span> Classifiers</h2>
<div class="outline-text-2" id="text-4">
<p>
If the classification is known, the feature values could be predicted
\[ P(\text{Class} \mid X_{1} \dots X_{n}) \propto P(X_{1}, \dots, X_{n} \mid \text{Class}) P(\text{Class}) \]
</p>

<p>
With a <b>Naive Bayesian classifier</b> \(X_{i}\) are independent of each other given the class,
though this requires \(P(\text{Class})\) and \(P(X_{i} \mid \text{Class})\) for each \(X_{i}\).
</p>
</div>
<div id="outline-container-org64a6470" class="outline-3">
<h3 id="org64a6470"><span class="section-number-3">4.1.</span> Laplace Correction</h3>
<div class="outline-text-3" id="text-4-1">
<p>
If a feature never occurs in the training set, but it does in the test set, ML
assigns 0 probability to a high likelihood class.
</p>

<p>
To correct for this, add 1 to the numerator and \(d\) to the denominator, where \(d\)
is the arity of the variable.
</p>
</div>
</div>
<div id="outline-container-org805510b" class="outline-3">
<h3 id="org805510b"><span class="section-number-3">4.2.</span> Bayesian Network Parameter Learning</h3>
<div class="outline-text-3" id="text-4-2">
<p>
For fully observed data with:
</p>
<ul class="org-ul">
<li>parameters \(\theta_{V, pa(V) = v^{i}}\)</li>
<li>CPTs \(\theta_{V, pa(V) = v} = P(V \mid pa(V) = v)\)</li>
<li>data \(d\) where
\[ d_{i} = \left< V_{1} = v_{1, i}, \dots, V_{n} = v_{n, i} \right> \]</li>
</ul>

<p>
To get the maximum likelihood, set \(\theta_{V, pa(V) = v}\) to the relative frequency of
values of \(V\) given the values \(v\) of the parents of \(V\).
</p>
</div>
</div>
<div id="outline-container-orga1c6616" class="outline-3">
<h3 id="orga1c6616"><span class="section-number-3">4.3.</span> Occam&rsquo;s Razor</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Simplicity is encouraged in the likelihood function.
A hypothesis that is more complex (lower bias) can explain more datasets but it
can only explain each with lower probability (higher variance).
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: DESKTOP-H800RKQ</p>
<p class="date">Created: 2024-11-11 Mon 01:20</p>
</div>
</body>
</html>
